# RbsEnergyAnalysisBuildingEnvelopeDeterminationParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisBuildingEnvelopeDeterminationParam Property
ParameterTypeId Class See Also
---
"Building Envelope"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeDeterminationParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisBuildingEnvelopeDeterminationParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisBuildingEnvelopeDeterminationParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace